<template>
  <div id="rules">
    <div class="tab">
      <button class="tablinks active" @click="openTab($event, 't1')">Правила игры</button>
      <button class="tablinks" @click="openTab($event, 't2')">Игровые карточки</button>
      <button class="tablinks" @click="openTab($event, 't3')">Валюта</button>
      <button class="tablinks" @click="openTab($event, 't4')">ICO</button>
      <button class="tablinks" @click="openTab($event, 't5')">Таблица курса криптовалют</button>
      <button class="tablinks" @click="openTab($event, 't6')">Начало игры</button>
      <button class="tablinks" @click="openTab($event, 't7')">Ход игры</button>
      <button class="tablinks" @click="openTab($event, 't8')">Игровое поле</button>
      <button class="tablinks" @click="openTab($event, 't9')">Для ведущего | Описание проектов ICO</button>
    </div>

    <div id="t1" class="tabcontent" style="display: block">
      <p><strong>BlockchainPoly</strong> - настольная игра, которая погрузит вас и ваших друзей в мир блокчейна.
        Инвестируйте в криптовалюты, токены и новые проекты - зарабатывайте на их росте, не забывайте следить за
        новостями, получать новые знания, и просто отлично проведите время.</p>

      <p><strong>Цель игры</strong> - заработать больше всех!</p>
      <p>Победителем становится игрок, чьи активы в сумме имеют большую стоимость.</p>

      <p><strong>Время игры</strong> - определяется участниками или ведущим. Ведущий ставит таймер на выбранное время.
        По окончании игры все участники считают сумму заработанных активов. У кого больше всех, тот и победил.
        Рекомендуемое время игры - 1,5 часа.</p>

      <p><strong>В игре участвуют</strong> - от 2 до 5 игроков и 1 ведущий. Ведущий объясняет игрокам правила и
        описывает процессы, которые происходят во время игры. Ведущий также выполняет роль банкира - распределяет
        основной фонд на всех игроков. Ведущий так же заполняет таблицу изменения курсов токенов. Игроки перемещают
        фишки по полю и стараются заработать как можно больше</p>
    </div>

    <div id="t2" class="tabcontent">
      <p><strong>News</strong> - при попадании на поля «News» ведущий или игрок тянет одну карточку «News» - это
        новости, которые могут повлиять на ход игры.</p>
      <p><strong>?</strong> - при попадании на поле «?» ведущий тянет карточку с вопросом и озвучивает для всех игроков
        вопрос и варианты ответа. Игрок попавший на поле «?» отвечает на этот вопрос и зарабатывает сумму, указанную в
        карточке.</p>
      <p><strong>Education</strong> - при попадании на поле «Education» ведущий или игрок озвучивает содержание
        карточки. Игроку, попавшему на клетку «Education», предоставляется возможность приобрести новое знание, либо
        отказаться.</p>
      <p><strong>Cyber Events</strong> - при попадании на поле «Cyber Events» игрок забирает себе одну карточку.
        Карточка содержит ответ на один из вопросов из стопки «?». Игрок также имеет право продать эту карточку другому
        игроку.</p>
    </div>

    <div id="t3" class="tabcontent">
      <p><strong>GBG</strong> - (номиналом в 1000, 10 000, 50 000, 100 000, 500 000, 1 000 000) - основная валюта игры.
        Покупайте за GBG другие токены, расплачивайтесь за обучение и инвестируйте в проекты</p>
      <p><strong>BTC</strong> - (номиналом в 0.1 и 1) - биткоин. Курс биткоина растёт или падает в зависимости от
        новостей или других событий по ходу игры</p>
      <p><strong>ETH</strong> - (номиналом в 1 и 10) - эфир. Курс эфира растёт или падает в зависимости от новостей или
        других событий по ходу игры</p>
    </div>

    <div id="t4" class="tabcontent">
      <p><strong>ICO 1</strong> - токены первого проекта, который проводит ICO. Приобретая карточки по 10%, вы
        инвестируете в ICO #1. Курс токенов первого проекта растёт или падает в зависимости от новостей или других
        событий по ходу игры</p>
      <p><strong>ICO 2</strong> - токены второго проекта, который проводит ICO. Приобретая карточки по 10%, вы
        инвестируете в ICO #2. Курс токенов второго проекта растёт или падает в зависимости от новостей или других
        событий по ходу игры</p>
      <p><strong>ICO 3</strong> - токены третьего проекта, который проводит ICO. Приобретая карточки по 10%, вы
        инвестируете в ICO #3. Курс токенов третьего проекта растёт или падает в зависимости от новостей или других
        событий по ходу игры</p>
      <p><strong>ICO 4</strong> - токены четвертого проекта, который проводит ICO. Приобретая карточки по 10%, вы
        инвестируете в ICO #4. Курс токенов четвёртого проекта растёт или падает в зависимости от новостей или других
        событий по ходу игры</p>
    </div>

    <div id="t5" class="tabcontent">
      <p>Для подсчёта изменения курса криптовалют и токенов воспользуйтесь таблицей Cryptocurrency Rate. Удобнее всего
        скопировать электронную версию таблицы по ссылке: <a href="https://goo.gl/cF1XgH">https://goo.gl/cF1XgH</a> и
        вести подсчёты в ней. Также можно использовать печатную версию, однако все подсчёты придётся вести на
        калькуляторе вручную.</p>

      <p>При изменении курса в соответствии с событиями в ходе игры, укажите процент изменения той или иной</p>
    </div>

    <div id="t6" class="tabcontent">
      <p>- Ведущий раздаёт каждому из игроков по 1 000 000 GBG</p>
      <p>- Каждый игрок выбирает себе цвет фишки. Все фишки стартуют с поля «Golos»</p>
      <p>- Все игроки по очереди бросают кубики - у кого выпадает наибольшее количество очков, ходит первым. Остальные
        по часовой стрелке.</p>
    </div>

    <div id="t7" class="tabcontent">
      <p>По очереди бросайте кубики, перемещайтесь по полю по часовой стрелке в зависимости от выпавших очков.
        Выполняйте задания на карточках, смотрите, как развиваются события и старайтесь заработать больше всех.</p>
    </div>

    <div id="t8" class="tabcontent">
      <p><strong>GOLOS</strong> - игрок, попавший на клетку, получает вознаграждение от платформы Golos.io в размере 200
        000 GBG</p>

      <p><strong>CYBER EVENTS</strong> - игрок, попавший на клетку получает одну карточку из колоды «Cyber Events». В
        карточке содержится правильный ответ на один из вопросов из колоды «?». Вы можете в дальнейшем передать эту
        карточку другому игроку за вознаграждение или бесплатно</p>

      <p><strong>DEX</strong> - попав на поле DEX (децентрализованная биржа) игрок может совершить обмен имеющихся у
        него токенов на любые другие у ведущего по текущему курсу. Другие игроки также могут попросить игрока,
        находящегося на поле DEX обменять их токены, при этом игрок, находящийся на поле DEX, может потребовать любой
        процент в качестве своего вознаграждения.</p>
      <p>После обмена игрок, который находится на поле DEX, бросает кубики - выпавшая сумма равна % на который
        повышается стоимость всех токенов в его портфеле. Не забудьте зафиксировать изменение курса в таблице</p>

      <p><strong>MELONPORT</strong> - игрок, попавший на это поле, получает возможность купить 10% финального
        «криптопортфеля» любого другого игрока. Стоимость 10% - 100 000 GBG оплачивается в банк. За один раз можно
        купить не более 10%. Запишите имя выбранного игрока на карточке Melonport - она остается у Вас до конца игры.
        При финальном подсчете очков, не забудьте добавить полученные проценты к общей сумме своих активов.</p>

      <p><strong>MULTY</strong> - игрок, попавший на это поле, может обменять любые свои токены у ведущего на любые
        другие токены (BTC, ETH, ICO1, ICO2, ICO3, ICO4) по текущему курсу.</p>
      <p>После обмена игрок, который находится на поле Multy, бросает кубики - выпавшая сумма равна % на который
        повышается курс того вида токенов, которые он приобрел. Не забудьте зафиксировать изменение курса в таблице</p>

      <p><strong>EDUCATION</strong> - игрок, попавший на это поле, получает возможность пройти обучение, посетить митап,
        тренинг или конференцию - получить то или иное знание, овладеть навыком. Если игрок оплачивает обучение, ведущий
        выдаёт ему карточку-сертификат из колоды «Education» - она остается у игрока в течение игры.</p>

      <p><strong>HARD FORK</strong> - игрок, попавший на это поле, должен выбрать токен, который форкается. В
        результате, выбранный токен умножается в два раза у всех, кто им обладает. Ведущий выдаёт из банка игрокам такое
        же количество токенов, которое у них имеется.</p>

      <p><strong>WHITE HATS</strong> - игрок, попавший на это поле, может провести технический аудит любого токена,
        который задействован в игре. Стоимость 30 000 GBG. Такой аудит может спасти токен в случае взлома или хакерской
        атаки.</p>

      <p><strong>AIRALAB</strong> - технология игрока, попавшего на это поле, успешно интегрирована в децентрализованную
        экономику роботов. Игрок получает награду в 100 000 GBG</p>

      <p><strong>STEEPSHOT</strong> - при попадании на это поле необходимо разместить селфи с командой в любой
        социальной сети с хэштегом #cyberevents. Награда за действие - 100 000 GBG. Игрок также может получить награду
        100 000 GBG, если разместит селфи в сети Steepshot</p>

      <p><strong>NEWS</strong> - игрок, попавший на эту клетку, зачитывает новость из колоды «News». Новость влияет на
        ход игры и отражается на всех игроках. После прочтения карточки, обязательно выполните требования, указанные в
        ней</p>

      <p><strong>?</strong> - при попадании любого игрока на эту клетку, ведущий зачитывает вопрос из колоды «?» вслух.
        Игрок может ответить на вопрос сам, а может воспользоваться подсказкой другого игрока бесплатно или за
        вознаграждение. Игрок, правильно ответивший на вопрос, получает вознаграждение, указанное в карточке. Также не
        забывайте пользоваться карточками Cyber Events</p>

      <p><strong>PROMO</strong> - игроку, попавший на это поле, должен разместить пост в любой социальной сети с
        хэштегом #cyberevents. Награда за действие - 200 000 GBG.</p>

      <p><strong>BLOCKCHAIN HACKATHON</strong> - игрок, попавший на это поле, принимает участие в блокчейн-хакатоне. Он
        представляет идею своего блокчейн-проекта другим игрокам. Игроки могут поддержать эту идею и дать игроку любое
        вознаграждение из своих личных активов.</p>

      <p><strong>GITHUB</strong> - игрок, попавший на это поле, написал и залил на Гитхаб код одного из
        блокчейн-проектов, проводивших ICO. Игрок должен выбрать ICO 1, 2, 3 или 4 - стоимость его токенов вырастает на
        10%. Не забудьте зафиксировать изменение курса в таблице.</p>

      <p><strong>HYPE</strong> - все токены (за исключением GBG) выросли на 20%. Не забудьте зафиксировать изменение
        курса в таблице.</p>

      <p><strong>CYBER•SEARCH</strong> - все токены, которые имеются в портфеле игрока, попавшего на это поле,
        проиндексированы поисковиком cyber•Search. Стоимость этих токенов растет на 10%. Зафиксируйте изменение курса в
        таблице.</p>

      <p><strong>DAO CASINO</strong> - игрок, попавший на это поле, делает ставку на четную или нечетную цифру на
        кубиках. Бросает кубики. В случае победы забирает свою сумму себе + сумму равную ставке из банка. В случае
        поражения возвращает начальную ставку в банк</p>

      <p><strong>BLOCKCHAIN SCHOOL</strong> - пропустите ход и получите две карточки из колоды «Cyber Events»</p>

      <p><strong>ANTIHYPE</strong> - игрок, попавший на это поле, может выбрать любой токен (кроме GBG), стоимость
        которого упадет на 30%. Зафиксируйте изменение курса в таблице.</p>

      <p><strong>CYBER•STUDIO</strong> - игрок, попавший на это поле, выбирает проект ICO 1, 2, 3 или 4, стоимость
        токенов которого увеличивается на 20% после удачно проведенного ICO. Не забудьте зафиксировать изменение курса в
        таблице.</p>

      <p><strong>ICO</strong> - при прохождении поля «ICO» первый раз (останавливаясь или проходя), игрок получает
        возможность инвестировать в ICO:</p>
      <p>Ведущий зачитывает описание проекта. Вы можете стать инвестором либо передать право приобретения токенов этого
        проекта любому желающему игроку за вознаграждение.</p>
      <p>Тот игрок, который прошел поле «ICO» первым, получает право выкупить токены ICO 1 со скидкой, предусмотренной в
        описании проекта. Токены, которые не были выкуплены этим игроком, выставляются на аукцион для других
        участников.</p>
      <p>Игрок, который проходит поле «ICO» вторым, может выкупить токены ICO 2 со скидкой. Токены, которые не были
        выкуплены этим игроком, выставляются на аукцион для других участников.</p>
      <p>При следующем прохождении поля «ICO», участнику, который его прошел, предоставляется право первому выкупить
        токены ICO 3. Токены, которые не были выкуплены этим игроком, выставляются на аукцион для других участников.</p>
      <p>Когда поле «ICO» проходится участником в четвертый раз, этому участнику предоставляется право первому выкупить
        токены ICO 4. Токены, которые не были выкуплены этим игроком, выставляются на аукцион для других участников.</p>

      <p>После того, как токены всех 4 проектов будут распроданы со скидками, при попадании на эту клетку, игрок может
        купить оставшиеся токены любого проекта из банка или у других участников. Также можно продать в банк любое
        количество токенов ICO по текущей рыночной цене.</p>

      <p>После того, как все токены будут распроданы, при попадании на клетку ICO игрок бросает кубики. Выпавшее число
        равно % на который повышается стоимость токенов, находящихся в портфеле игрока на клетке.</p>
      <p>Не забудьте зафиксировать изменение курса в таблице.</p>
    </div>

    <div id="t9" class="tabcontent">
      <p><strong>ICO 1 (green)</strong> - Вам предлагается поучаствовать в покупке токенов на ICO. Текущий проект
        представляет собой блокчейн-систему, которая разрабатывается для обеспеспечения взаимодействия и обмена данными
        между разными блокчейн-протоколами. На ICO продается 60% токенов от объема эмиссии, предлагается скидка в 10%
        при покупке не менее 10% от общего объема продаваемых токенов (6 карточек из 10 по цене 90 000 GBG). Рыночная
        капитализация 1 000 000 GBG.</p>

      <p><strong>ICO 2 (red)</strong> - Вам предлагается поучаствовать в покупке токенов на ICO. Текущий проект
        представляет собой блокчейн-протокол, предназначенный для децентрализованного поиска информации по блокчейнам.
        На ICO продается 70% токенов от объема эмиссии, предлагается скидка в 20% при покупке не менее 10% от общего
        объема продаваемых токенов (7 карточек из 10 по цене 80 000 GBG). Рыночная капитализация 1 000 000 GBG.</p>

      <p><strong>ICO 3 (blue)</strong> - Вам предлагается поучаствовать в покупке токенов на пресейле. Текущий проект
        представляет собой бизнес по перевозке грузов на территории Европы. Текущая система перевозке в части хранения
        информации переводится на приватный блокчейн, к которому дают доступ заказавшему перевозку для отслеживания
        грузов. Токены, предлагаемые на ICO, дают право владельцу на гарантированный доход в 3% годовых. На ICO
        продается 50% токенов от объема эмиссии, предлагается скидка в 20% при покупке токенов на пресейле(5 из 10
        карточек по цене 80 000 GBG). Рыночная капитализация 1 000 000 GBG.</p>

      <p><strong>ICO 4 (yellow)</strong> - Вам предлагается поучаствовать в покупке токенов на ICO. Текущий проект
        представляет собой строительную компанию, которая поднимает инвестиции для строительства жилого комплекса
        премиум-класса в Ницце, Франция. Токены, предлагаемые на ICO, дают право владельцу на квадратные метры в новом
        комплексе (пропорционально количеству токенов при фиксированной цене квадратного метра на момент ICO). На ICO
        продается 50% токенов от объема эмиссии(5 из 10 карточек по цене 100 000 GBG) . Рыночная капитализация 1 000 000
        GBG.</p>
    </div>
  </div>
</template>

<script>
  import TabsMixin from '@/mixins/tabs';

  export default {
    name: 'rules',
    mixins: [
      TabsMixin,
    ],
  };
</script>

<style scoped>
  p {
    text-align: center;
  }

  .tabcontent p {
    text-align: left;
  }
</style>
